package com.ivan.learning.ThinkingInJava.chapter02;

/* Написать программу, которая выводит три параметра командной строки */

public class Exercise10 {
    public static void main(String[] args) {
        System.out.println(args[0]);
        System.out.println(args[1]);
        System.out.println(args[2]);
    }
}
